renesas/FreeRTOS/FreeRTOS/Demo/RX100_RX130_TB_Renesas_e2studio_CS+/src/frtos_startup/freertos_start.c
/*******************************************************************************
* DISCLAIMER
* This software is supplied by Renesas Electronics Corporation and is only 
* intended for use with Renesas products. No other uses are authorized. This 
* software is owned by Renesas Electronics Corporation and is protected under
* all applicable laws, including copyright laws.
* THIS SOFTWARE IS PROVIDED "AS IS" AND RENESAS MAKES NO WARRANTIES REGARDING
* THIS SOFTWARE, WHETHER EXPRESS, IMPLIED OR STATUTORY, INCLUDING BUT NOT
* LIMITED TO WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE 
* AND NON-INFRINGEMENT. ALL SUCH WARRANTIES ARE EXPRESSLY DISCLAIMED.
* TO THE MAXIMUM EXTENT PERMITTED NOT PROHIBITED BY LAW, NEITHER RENESAS 
* ELECTRONICS CORPORATION NOR ANY OF ITS AFFILIATED COMPANIES SHALL BE LIABLE 
* FOR ANY DIRECT, INDIRECT, SPECIAL, INCIDENTAL OR CONSEQUENTIAL DAMAGES FOR
* ANY REASON RELATED TO THIS SOFTWARE, EVEN IF RENESAS OR ITS AFFILIATES HAVE
* BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.
* Renesas reserves the right, without notice, to make changes to this software
* and to discontinue the availability of this software. By using this software,
* you agree to the additional terms and conditions found by accessing the 
* following link:
* http://www.renesas.com/disclaimer
* Copyright (C) 2018 Renesas Electronics Corporation. All rights reserved.    
*******************************************************************************/
/*******************************************************************************
* File Name    : freertos_start.c
* Version      : 1.0
* Description  : Contains FreeRTOS user-defined functions.
******************************************************************************/
/*****************************************************************************
* History : DD.MM.YYYY Version  Description
*         : 30.06.2016 1.00     First Release
******************************************************************************/

/******************************************************************************
Includes   <System Includes> , "Project Includes"
******************************************************************************/
#include <string.h>
#include "platform.h"
#include "freertos_start.h"
#include "demo_main.h"
#include "demo_specific_io.h"

#if (BSP_CFG_RTOS_USED == 1)

#if (RTOS_USB_SUPPORT == 1)
#include "r_usb_basic_if.h"
#include "r_usb_cstd_rtos.h"
#endif

/******************************************************************************
Macro definitions
******************************************************************************/

/******************************************************************************
Typedef definitions
******************************************************************************/

/******************************************************************************
Private global variables and functions
******************************************************************************/

/************* semaphore initialization *****************/

/******************************************************************************
Exported global variables (to be accessed by other files)
******************************************************************************/

/******************************************************************************
Exported global functions (to be accessed by other files)
******************************************************************************/

/* FreeRTOS's system timer. */
void vApplicationSetupTimerInterrupt(void);

/* Hook functions used by FreeRTOS. */
void vAssertCalled(void);
void vApplicationIdleHook(void);
void vApplicationTickHook(void);
void vApplicationMallocFailedHook(void);
void vApplicationStackOverflowHook(TaskHandle_t xTask, char *pcTaskName);

/* FreeRTOS's processing before start the kernel. */
void Processing_Before_Start_Kernel(void);

/* Main task. */
extern void main_task(void *pvParameters);


/******************************************************************************
* Function Name: vApplicationSetupTimerInterrupt
* Description  : Initialize system timer for FreeRTOS with tick interrupt 1ms.
* Arguments    : None.
* Return Value : None.
******************************************************************************/
void vApplicationSetupTimerInterrupt(void)
{
	/* CMT channel 0 is configured as RTOS's system timer. */
#if (BSP_CFG_RTOS_SYSTEM_TIMER == 0)
    /* Protect off. */
    SYSTEM.PRCR.WORD = 0xA502;

    /* Enable compare match timer 0. */
    MSTP( CMT0 ) = 0;

    /* Stop counter. */
    CMT.CMSTR0.BIT.STR0 = 0;

    /* Protect on. */
    SYSTEM.PRCR.WORD = 0xA500;

    /* Enable interrupt on compare match.
     * Divide the PCLK by 8. */
    CMT0.CMCR.WORD = 0x00C0; // CKS=00b,CMIE=1; PCLK/8,Compare match interrupt (CMIn) enabled @60MHz

    /* Set the compare match value. */
    CMT0.CMCOR = ( unsigned short ) ( ( ( configPERIPHERAL_CLOCK_HZ / configTICK_RATE_HZ )) / 8 - 1);

    /* Clear counter. */
    CMT0.CMCNT = 0;

    /* Clear any previously pending interrupts. */
    IR(CMT0, CMI0)  = 0;

    /* Enable the interrupt. */
    IEN(CMT0, CMI0) = 1;

    /* Set its priority to the application defined kernel priority. */
    IPR(CMT0, CMI0) = configKERNEL_INTERRUPT_PRIORITY;

    /* Start the timer 0. */
    CMT.CMSTR0.BIT.STR0 = 1;
#endif /* (BSP_CFG_RTOS_SYSTEM_TIMER == 0) */

    /* CMT channel 1 is configured as RTOS's system timer. */
#if (BSP_CFG_RTOS_SYSTEM_TIMER == 1)
    /* Protect off. */
    SYSTEM.PRCR.WORD = 0xA502;

    /* Enable compare match timer 1. */
    MSTP( CMT1 ) = 0;

    /* Stop counter. */
    CMT.CMSTR0.BIT.STR1 = 0;

    /* Protect on. */
    SYSTEM.PRCR.WORD = 0xA500;

    /* Enable interrupt on compare match.
     * Divide the PCLK by 8. */
    CMT1.CMCR.WORD = 0x00C0; // CKS=00b,CMIE=1; PCLK/8,Compare match interrupt (CMIn) enabled @60MHz

    /* Set the compare match value. */
    CMT1.CMCOR = ( unsigned short ) ( ( ( configPERIPHERAL_CLOCK_HZ / configTICK_RATE_HZ )) / 8 - 1);

    /* Clear counter. */
    CMT1.CMCNT = 0;

    /* Clear any previously pending interrupts. */
    IR(CMT1, CMI1)  = 0;

    /* Enable the interrupt. */
    IEN(CMT1, CMI1) = 1;

    /* Set its priority to the application defined kernel priority. */
    IPR(CMT1, CMI1) = configKERNEL_INTERRUPT_PRIORITY;

    /* Start the timer 1. */
    CMT.CMSTR0.BIT.STR1 = 1;
#endif /* (BSP_CFG_RTOS_SYSTEM_TIMER == 1) */

    /* CMT channel 2 is configured as RTOS's system timer. */
#if (BSP_CFG_RTOS_SYSTEM_TIMER == 2)
    /* Protect off. */
    SYSTEM.PRCR.WORD = 0xA502;

    /* Enable compare match timer 2. */
    MSTP( CMT2 ) = 0;

    /* Stop counter. */
    CMT.CMSTR1.BIT.STR2 = 0;

    /* Protect on. */
    SYSTEM.PRCR.WORD = 0xA500;

    /* Enable interrupt on compare match.
     * Divide the PCLK by 8. */
    CMT2.CMCR.WORD = 0x00C0; // CKS=00b,CMIE=1; PCLK/8,Compare match interrupt (CMIn) enabled @60MHz

    /* Set the compare match value. */
    CMT2.CMCOR = ( unsigned short ) ( ( ( configPERIPHERAL_CLOCK_HZ / configTICK_RATE_HZ )) / 8 - 1);

    /* Clear counter. */
    CMT2.CMCNT = 0;

    /* Clear any previously pending interrupts. */
    IR(CMT2, CMI2)  = 0;

    /* Enable the interrupt. */
    IEN(CMT2, CMI2) = 1;

    /* Set its priority to the application defined kernel priority. */
    IPR(CMT2, CMI2) = configKERNEL_INTERRUPT_PRIORITY;

    /* Start the timer 2. */
    CMT.CMSTR1.BIT.STR2 = 1;
#endif /* (BSP_CFG_RTOS_SYSTEM_TIMER == 2) */

    /* CMT channel 3 is configured as RTOS's system timer. */
#if (BSP_CFG_RTOS_SYSTEM_TIMER == 3)
    /* Protect off. */
    SYSTEM.PRCR.WORD = 0xA502;

    /* Enable compare match timer 3. */
    MSTP( CMT3 ) = 0;

    /* Stop counter. */
    CMT.CMSTR1.BIT.STR3 = 0;

    /* Protect on. */
    SYSTEM.PRCR.WORD = 0xA500;

    /* Enable interrupt on compare match.
     * Divide the PCLK by 8. */
    CMT3.CMCR.WORD = 0x00C0; // CKS=00b,CMIE=1; PCLK/8,Compare match interrupt (CMIn) enabled @60MHz

    /* Set the compare match value. */
    CMT3.CMCOR = ( unsigned short ) ( ( ( configPERIPHERAL_CLOCK_HZ / configTICK_RATE_HZ )) / 8 - 1);

    /* Clear counter. */
    CMT3.CMCNT = 0;

    /* Clear any previously pending interrupts. */
    IR(CMT3, CMI3)  = 0;

    /* Enable the interrupt. */
    IEN(CMT3, CMI3) = 1;

    /* Set its priority to the application defined kernel priority. */
    IPR(CMT3, CMI3) = configKERNEL_INTERRUPT_PRIORITY;

    /* Start the timer 3. */
    CMT.CMSTR1.BIT.STR3 = 1;
#endif /* (BSP_CFG_RTOS_SYSTEM_TIMER == 3) */

} /* End of function vApplicationSetupTimerInterrupt() */

/******************************************************************************
* Function Name: vAssertCalled
* Description  : This function is used to validate the input parameters.
* Arguments    : None.
* Return Value : None.
******************************************************************************/
void vAssertCalled(void)
{
    volatile unsigned long ul = 0;

    taskENTER_CRITICAL();
    {
        vPrintString( "\r\n" );
        vPrintString( "Assertion failed!\n" );

        /* Use the debugger to set ul to a non-zero value in order to step out
        of this function to determine why it was called. */
        while( 0 == ul )
        {
            portNOP();
        }
    }
    taskEXIT_CRITICAL();

} /* End of function vAssertCalled() */

/******************************************************************************
* Function Name: vApplicationIdleHook
* Description  : This function will be called on each cycle of the idle task.
*                NOTE: vApplicationIdleHook() MUST NOT CALL A FUNCTION
*                      THAT MIGHT BLOCK UNDER ANY CIRCUMSTANCES.
* Arguments    : None.
* Return Value : None.
******************************************************************************/
void vApplicationIdleHook(void)
{
    volatile size_t xFreeHeapSpace;

    /* This is just a trivial example of an idle hook.  It is called on each
    cycle of the idle task.  It must *NOT* attempt to block.  In this case the
    idle task just queries the amount of FreeRTOS heap that remains.  See the
    memory management section on the http://www.FreeRTOS.org web site for memory
    management options.  If there is a lot of heap memory free then the
    configTOTAL_HEAP_SIZE value in FreeRTOSConfig.h can be reduced to free up
    RAM. */
    xFreeHeapSpace = xPortGetFreeHeapSize();

    /* Remove compiler warning about xFreeHeapSpace being set but never used. */
    ( void ) xFreeHeapSpace;

} /* End of function vApplicationIdleHook() */

/******************************************************************************
* Function Name: vApplicationTickHook
* Description  : This function will be called every tick interrupt.
*                NOTE: vApplicationTickHook() EXECUTES FROM WITHIN AN ISR,
*                      SO MUST BE VERY SHORT AND NOT USE MUCH STACK.
*                      IN ADDITION, NOT CALL ANY APIs WITHOUT "FromISR" OR
*                      "FROM_ISR" AT THE END.
* Arguments    : None.
* Return Value : None.
******************************************************************************/
void vApplicationTickHook(void)
{
    /* The tick hook is not used by the blinky demo, but is by the full demo. */
    #if mainCREATE_SIMPLE_BLINKY_DEMO_ONLY == 0
    {
        extern void vFullDemoTickHook( void );

        vFullDemoTickHook();
    }
    #endif

} /* End of function vApplicationTickHook() */

/******************************************************************************
* Function Name: vApplicationMallocFailedHook
* Description  : This function is to capture the failure while
*                memory allocation.
* Arguments    : None.
* Return Value : None.
******************************************************************************/
void vApplicationMallocFailedHook(void)
{
    /* Called if a call to pvPortMalloc() fails because there is insufficient
    free memory available in the FreeRTOS heap.  pvPortMalloc() is called
    internally by FreeRTOS API functions that create tasks, queues, software
    timers, and semaphores.  The size of the FreeRTOS heap is set by the
    configTOTAL_HEAP_SIZE configuration constant in FreeRTOSConfig.h. */

    taskENTER_CRITICAL();
    vPrintString( "\r\n" );
    vPrintString( "Insufficient heap memory!\n" );

    /* Force an assert. */
    configASSERT( ( volatile void * ) NULL );

    taskDISABLE_INTERRUPTS();
    for( ; ; )
    {
        /* Loop here */
    };

} /* End of function vApplicationMallocFailedHook() */

/******************************************************************************
* Function Name: vApplicationStackOverflowHook
* Description  : Hook function is to capture the failure when the stack size
*                is insufficient for processing.
* Arguments    : pxTask -
*                    Task handler
*                pcTaskName -
*                    Pointer of where to store the task's name
* Return Value : None.
******************************************************************************/
void vApplicationStackOverflowHook(TaskHandle_t pxTask, char *pcTaskName)
{
    ( void ) pcTaskName;
    ( void ) pxTask;

    /* Run time stack overflow checking is performed if
    configCHECK_FOR_STACK_OVERFLOW is defined to 1 or 2.  This hook
    function is called if a stack overflow is detected. */

    taskENTER_CRITICAL();
    vPrintString( "\r\n" );
    vPrintString( "Stack Overflow!\n" );

    /* Force an assert. */
    configASSERT( ( volatile void * ) NULL );

    taskDISABLE_INTERRUPTS();
    for( ; ; )
    {
        /* Loop here */
    };

} /* End of function vApplicationStackOverflowHook() */

/******************************************************************************
* Function Name: vPrintString
* Description  : This function is used to write a string to the Debug Console.
*                NOTE: EWRX doesn't have the Debug Console. When you use ICCRX,
*                if you want to use the Debug Console, use e2 studio instead.
* Arguments    : pcMessage -
*                    Pointer to the string
* Arguments    : pcMessage.
* Return Value : None.
******************************************************************************/
void vPrintString(const char *pcMessage)
{
#ifdef ideDISABLE_DEBUG_CONSOLE

    INTERNAL_NOT_USED( pcMessage );

#else

    /* Write the string to the Debug Console, using a critical section
    as a crude method of mutual exclusion. */

    taskENTER_CRITICAL();
    {
        while( *pcMessage )
        {
            charput(*pcMessage++);
        }
    }
    taskEXIT_CRITICAL();

#endif
} /* End of function vPrintString() */

/******************************************************************************
* Function Name : Processing_Before_Start_Kernel
* Description   : Create a main task, FreeRTOS's objects (e.g. mailbox, task,
*                 semaphore, mutex...) if required.
* Arguments     : None.
* Return value  : None.
******************************************************************************/
void Processing_Before_Start_Kernel(void)
{
#if 0 /* Generated Renesas Code */

    BaseType_t ret;

    /************** semaphore creation ***********************/



    /************** mutex creation ***************************/


    /************** queues creation **************************/


    /************** event groups creation ********************/


    /************** mailbox creation *************************/


    /************** memory pool creation *********************/
    
    /** USB RTOS Configuration **/
#if (RTOS_USB_SUPPORT == 1)
    usb_rtos_err_t err = usb_rtos_configuration();
    if (UsbRtos_Success != err)
    {
        while(1)
        {
            /** Failure of UsbRtos Configuration **/
        }
    }
#endif

    Kernel_Object_init();

    /************** task creation ****************************/
    /* Main task. */
    ret = xTaskCreate(main_task, "MAIN_TASK", 512, NULL, 3, NULL);
    if (pdPASS != ret)
    {
        while(1)
        {
            /* Failed! Task can not be created. */
        }
    }

#else /* Run FreeRTOS Demo */

    demo_main();

#endif

} /* End of function Processing_Before_Start_Kernel() */

/*-----------------------------------------------------------*/

/*
 * Configure the hardware as necessary to run this demo.
 */
static void prvSetupHardware( void );

/*
 * main_blinky() is used when mainCREATE_SIMPLE_BLINKY_DEMO_ONLY is set to 1.
 * main_full() is used when mainCREATE_SIMPLE_BLINKY_DEMO_ONLY is set to 0.
 */
#if( mainCREATE_SIMPLE_BLINKY_DEMO_ONLY == 1 )
    extern void main_blinky( void );
#else
    extern void main_full( void );
#endif /* #if mainCREATE_SIMPLE_BLINKY_DEMO_ONLY == 1 */

/*-----------------------------------------------------------*/

void demo_main( void )
{
    /* Configure the hardware ready to run the demo. */
    prvSetupHardware();

    /* The mainCREATE_SIMPLE_BLINKY_DEMO_ONLY setting is described at the top
    of this file. */
    #if( mainCREATE_SIMPLE_BLINKY_DEMO_ONLY == 1 )
    {
        main_blinky();
    }
    #else
    {
        main_full();
    }
    #endif

    /* Should never get reached. */
    return;
}
/*-----------------------------------------------------------*/

static void prvSetupHardware( void )
{
    /* Turn on the LED at start. (The system initialization had been done in the
    src/smc_gen/general/r_cg_hardware_setup.c.) */
    vToggleLED();

    /* Write "\r\n" to the UART and/or the Debug Console. */
    vSendString( "\r\n" );
}
/*-----------------------------------------------------------*/

void vToggleLED( void )
{
    /* Toggle the LED */
    LED0 = !LED0;
}
/*-----------------------------------------------------------*/

void vSendString( const char * const pcString )
{
    /* Write the string to the Debug Console. */
    vPrintString( pcString );

    /* Write the string to the UART. It is done in case of the simple blinky demo
    only but it isn't done in case of the full demo because the UART is used for
    other purpos "FreeRTOS+CLI command console" by the full demo. */
    #if( mainCREATE_SIMPLE_BLINKY_DEMO_ONLY == 1 )
    {
        R_SCI_Send( xSerialSciHandle, ( uint8_t * )pcString, strlen(pcString) );
    }
    #endif
}
/*-----------------------------------------------------------*/

void *malloc( size_t xWantedSize )
{
#if BSP_CFG_RTOS_USED == 1
    /* FreeRTOS */

    return pvPortMalloc( xWantedSize );
#else
    /* SEGGER embOS */
    /* Micrium MicroC/OS */
    /* Renesas RI600V4 & RI600PX */

    #error "Unsupported RTOS is selected."
#endif
}

/* Replacement to be thread-safe (in case of other than using heap_3.c). */
void free( void *pv )
{
#if BSP_CFG_RTOS_USED == 1
    /* FreeRTOS */

    vPortFree( pv );
#else
    /* SEGGER embOS */
    /* Micrium MicroC/OS */
    /* Renesas RI600V4 & RI600PX */

    #error "Unsupported RTOS is selected."
#endif
}

#if defined(__GNUC__)

/* Just for convenience.
 */
#define brk()               R_BSP_BRK()
#define int_exception(x)    R_BSP_INT(x)
#define wait()              R_BSP_WAIT()
#define nop()               R_BSP_NOP()

#endif /* defined(__GNUC__) */

#if defined(__GNUC__) || defined(__ICCRX__)

/* Just for convenience.
 */
#define setpsw_i()  R_BSP_SETPSW_I()
#define clrpsw_i()  R_BSP_CLRPSW_I()

#endif /* defined(__GNUC__) || defined(__ICCRX__) */

#if defined(__CDT_PARSER__)

#if defined(__CCRX__)

/* Workaround for missing pre-defined macro in the Renesas Toolchain Builtin
 * Language Settings. The following definition is demo specific.
 */
#ifdef __RXV3
#ifndef __TFU
#define __TFU 1
#endif
#endif

/* Workaround for wrong pre-defined macro in the Renesas Toolchain Builtin
 * Language Settings. The following definition is demo specific.
 */
#ifdef __RXV3
#ifdef __DBL4
#undef __DBL4
#endif
#ifndef __DBL8
#define __DBL8 1
#endif
#else
#ifndef __DBL4
#define __DBL4 1
#endif
#ifdef __DBL8
#undef __DBL8
#endif
#endif

#endif /* defined(__CCRX__) */

#if defined(__GNUC__) || defined(__ICCRX__)

/* Workaround to reduce errors/warnings caused by e2 studio CDT's INDEXER and CODAN.
 */
#ifndef __asm
#define __asm asm
#endif
#ifndef __attribute__
#define __attribute__(...)
#endif

#endif /* defined(__GNUC__) || defined(__ICCRX__) */

#endif /* defined(__CDT_PARSER__) */

#if defined(__CCRX__)

/* This file has to be included by using CC-RX's -preinclude option. */

/* Workaround for warning messages caused by undefined preprocessing identifier.
 */
#ifndef _FEVAL
#define _FEVAL 0
#endif
#ifndef _FEVVAL
#define _FEVVAL 0
#endif
#ifndef _HAS_C9X_FAST_FMA
#define _HAS_C9X_FAST_FMA 0
#endif

#endif /* defined(__CCRX__) */

#if defined(__ICCRX__)

/* Workaround to reduce the following remark messages caused in the r_rx_compiler.h.
 *
 *   #define R_BSP_ASM(...)            _R_BSP_ASM(__VA_ARGS__\n)
 *                                                           ^
 * "XXX\r_rx_compiler.h",NNN  Remark[Pe007]: unrecognized token
 *
 * Turn on the remark messages here.
 */
#pragma diag_default = Pe007

/* Workaround to reduce the following remark messages. (The following is example.)
 *
 *   #define R_BSP_ASM(...)            _R_BSP_ASM(__VA_ARGS__\n)
 *                                                           ^
 * "XXX\r_rx_compiler.h",NNN  Remark[Pe007]: unrecognized token
 *
 *       R_BSP_ASM(    SUB     #01H, R1                  )
 *                             ^
 * "XXX\r_bsp_common.c",NNN  Remark[Pe010]: "#" not expected here
 *
 *       R_BSP_ASM_BEGIN
 *       ^
 * "XXX\r_bsp_common.c",NNN  Remark[Pa174]: inline assembler statement has no declared
 * side-effect. All optimizations around it will be disabled. Either add side-effect
 * declarations or add volatile.
 *
 * Now redefine the following macros.
 */
#if !defined(__CDT_PARSER__)

#undef _R_BSP_ASM
#undef R_BSP_ASM
/* #undef R_BSP_ASM_LAB_NEXT */ /* no change */
/* #undef R_BSP_ASM_LAB_PREV */ /* no change */
/* #undef R_BSP_ASM_LAB */ /* no change */
#undef R_BSP_ASM_BEGIN
#undef R_BSP_ASM_END

#define _R_BSP_ASM(...)           #__VA_ARGS__ "\n"
#define R_BSP_ASM(...)            _R_BSP_ASM(__VA_ARGS__)
/* #define R_BSP_ASM_LAB_NEXT(n)     _lab##n */ /* no change */
/* #define R_BSP_ASM_LAB_PREV(n)     _lab##n */ /* no change */
/* #define R_BSP_ASM_LAB(n_colon)    R_BSP_ASM(_lab##n_colon) */ /* no change */
#define R_BSP_ASM_BEGIN           R_BSP_PRAGMA(diag_suppress = Pa174)\
                                  R_BSP_PRAGMA(diag_suppress = Pe010)\
                                  __asm volatile(
#define R_BSP_ASM_END             );\
                                  R_BSP_PRAGMA(diag_default = Pe010)\
                                  R_BSP_PRAGMA(diag_default = Pa174)

#endif /* !defined(__CDT_PARSER__) */

#endif /* defined(__ICCRX__) */

#endif /* (BSP_CFG_RTOS_USED == 1) */

